
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДГ.Очистить();
	ДГ.ОтображатьПустыеЗначения = Ложь;
	
	Сч = 0;
	
	Если Параметры.Свойство("ЗначениеПараметра") Тогда
	
		Для Каждого Строка Из Параметры.ЗначениеПараметра Цикл

			Сч = Сч + 1;
			
			Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
			Точка.Текст = Строка.Сотрудник;
			Серия = ДГ.УстановитьСерию(Сч);
			
			МесяцОтпуска = Формат(Строка.ДатаНачала,"ДФ=ММММ");
			СтрокаТекстаСерии = МесяцОтпуска + " (Дней-" + (Строка.КоличествоДней + 1) + ")";
			Серия.Текст = СтрокаТекстаСерии;
		
			Значение = ДГ.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
			
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
