
#Область ПрограммныйИнтерфейс
Процедура ВКМ_Уведомление() Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	
	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомлениеТелеграммБоту.Ссылка,
		|	ВКМ_УведомлениеТелеграммБоту.Текст
		|ИЗ
		|	Справочник.ВКМ_УведомлениеТелеграммБоту КАК ВКМ_УведомлениеТелеграммБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		Сообщение.Вставить("text", ВыборкаДетальныеЗаписи.Текст);
		
		СтрокаJSON = СтрокаJSON(Сообщение);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		КонецЕсли;
					
	КонецЦикла;
		
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Функция СтрокаJSON(ОбъектJSON)

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции
#КонецОбласти

