#language: ru

@tree

Функционал: <Закрытие заявок от имени специалиста>

Как <Специалист> я хочу
<закрыть заявки по итогу выполненных работ> 
чтобы <закрыть заявку за специалистом>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
Тогда открылось окно "Обслуживание клиентов"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиентов * от *"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов'
И в таблице 'ВыполненныеРаботы' я выбираю текущую строку
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "3"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "3"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
И в поле с именем 'Комментарий' я ввожу текст "Сетевое оборудование обслужено"
И я выбираю файл 'D:\Фичи\Результат работы специалиста.txt'
И я нажимаю на кнопку с именем 'ФормаСохранитьФайлВБазу'
Тогда открылось окно "Обслуживание клиентов * от * *"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиентов * от * *" в течение 20 секунд
