#language: ru

@tree

Функционал: <Массовое создание актов>

Как <Бухгалетр> я хочу
<массово заполнить таблицу услуг документа реализации> 
чтобы <услуги были заполненны автоматически>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю "Обслуживание клиентов" "Массовое создание актов"
Тогда открылось окно "Массовое создание актов"
И я нажимаю кнопку выбора у поля с именем 'Период'
Тогда открылось окно "Выберите период"
И я нажимаю на гиперссылку с именем 'SwitchText'
И я нажимаю на кнопку с именем 'QuarterVariant'
И в таблице 'PeriodVariantTable' я выбираю текущую строку
Тогда открылось окно "Массовое создание актов"
И в таблице 'ДоговорРеализация' я нажимаю на кнопку с именем 'ДоговорРеализацияДобавить'
И в таблице 'ДоговорРеализация' я нажимаю кнопку выбора у реквизита с именем 'ДоговорРеализацияДоговор'
Тогда открылось окно "Договоры контрагентов"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Массовое создание актов"
И в таблице 'ДоговорРеализация' я активизирую поле с именем 'ДоговорРеализацияРеализацияПоДоговору'
И в таблице 'ДоговорРеализация' я нажимаю кнопку выбора у реквизита с именем 'ДоговорРеализацияРеализацияПоДоговору'
Тогда открылось окно "Реализации товаров и услуг"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Массовое создание актов"
И в таблице 'ДоговорРеализация' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаСозданиеРеализации'
