#language: ru

@tree

Функционал: <описание фичи>

Как <Бухгалтер> я хочу
<создать отчет анализ выставленных актов> 
чтобы <провести анализ>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю "Обслуживание клиентов" "Анализ выставленных актов"
Тогда открылось окно "Основной"
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
И я нажимаю на кнопку с именем 'СформироватьОтчет'
