
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Сергеев П.С. изменения в рамках дипломного проекта
	//добавляю новые элементы на форму программно
	ЭлементВидыДоговоровКонтрагентов = Элементы.Добавить("ВКМ_ВидыДоговоровКонтрагентов", Тип("ПолеФормы"));
	ЭлементВидыДоговоровКонтрагентов.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементВидыДоговоровКонтрагентов.ПутьКДанным = "Объект.ВКМ_ВидыДоговоровКонтрагентов";
	ЭлементВидыДоговоровКонтрагентов.УстановитьДействие("ПриИзменении", "ДействияПриИЗмененииДоговораКонтрагента");
	
	ЭлементНачалоДействияДоговора = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"));
	ЭлементНачалоДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементНачалоДействияДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	
	ЭлементКонецДействияДоговора = Элементы.Добавить("ВКМ_КонецДействияДоговора", Тип("ПолеФормы"));
	ЭлементКонецДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонецДействияДоговора.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	//делаю видимыми или нет некоторые добавленные объекты
	Если Объект.ВКМ_ВидыДоговоровКонтрагентов = Перечисления.ВКМ_ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;			
	КонецЕсли;
	//++ Сергеев П.С. изменения в рамках дипломного проекта

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ДействияПриИЗмененииДоговораКонтрагента(Элемент)

	//делаю видимыми или нет некоторые при изменении вида договора
	//++ Сергеев П.С. изменения в рамках дипломного проекта
	Если Объект.ВКМ_ВидыДоговоровКонтрагентов = ПредопределенноеЗначение("Перечисление.ВКМ_ВидыДоговоровКонтрагентов.АбонентскаяПлата") Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
	//++ Сергеев П.С. изменения в рамках дипломного проекта			

КонецПроцедуры
#КонецОбласти


