
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//таже процедура автозаполнения из модуля документа, только перенес ее сюда. не получилось достучаться до процедуры автозаполнения
	СозданиеРеализацииНаСервере();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СозданиеРеализацииНаСервере()
	
	Для Каждого Строки Из Объект.ДоговорРеализация Цикл
		
		ДокументРеализации = Строки.РеализацияПоДоговору;
		ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
		
		АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если Не ЗначениеЗаполнено(АбонентскаяПлата) Тогда
			ОбщегоНазначения.СообщитьПользователю("Абонентская плата не заполнена");
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
			ОбщегоНазначения.СообщитьПользователю("Работы специалиста не заполены");
			Возврат;
		КонецЕсли;
		
		ПолученныйДокумент.Услуги.Очистить();
		
		АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строки.Договор, "ВКМ_СуммаАбонентскойПлаты");
		
		Если АбонентскаяПлатаИзДоговора > 0 Тогда
			
			НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
			НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора; 
					
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Клиент = &Клиент
		|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПолученныйДокумент.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПолученныйДокумент.Дата));
		Запрос.УстановитьПараметр("Клиент", ПолученныйДокумент.Контрагент);	
		Запрос.УстановитьПараметр("Договор", ПолученныйДокумент.Договор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
				НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
				НоваяСтрока.Номенклатура = РаботыСпециалиста;
				НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
				НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
				НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
			КонецЕсли;
			
		КонецЦикла;
		
		СуммаДокумента = ПолученныйДокумент.Товары.Итог("Сумма") + ПолученныйДокумент.Услуги.Итог("Сумма");
		
		ПолученныйДокумент.Записать(); 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполнение документов закончено";
		Сообщение.Сообщить();
		
	КонецЦикла;

	//ДлительноеФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка), ПараметрыЗапуска, ПараметрыВыполнения);	

КонецПроцедуры
#КонецОбласти
